app/views/patients/show.html.erb

	<h4><%= @patient.address %></h4>
	<% if @patient.reports.count == 1 %>
---
SELECT "reports".* FROM "reports" WHERE "reports"."patient_id" = ?  [["patient_id", 13]]
SELECT COUNT(*) FROM "reports" WHERE "reports"."patient_id" = ?  [["patient_id", 12]]