app/controllers/patients_controller.rb

SELECT  "conditions".* FROM "conditions" WHERE "conditions"."name" = ? LIMIT ?  [["name", "Good"], ["LIMIT", 1]]
SELECT "patients".* FROM "patients" WHERE "patients"."condition_id" = ? ORDER BY created_at DESC  [["condition_id", 2]]
SELECT "patients".* FROM "patients" WHERE "patients"."doctor_id" = ? ORDER BY created_at DESC  [["doctor_id", 3]]
SELECT "patients".* FROM "patients" ORDER BY created_at DESC
---
	def index
		if params.has_key?(:condition)
			@condition_id = Condition.find_by(name: params[:condition]).id
			@patients = Patient.where(:condition_id => @condition_id).order("created_at DESC")
		elsif params.has_key?(:doctor_id)
			@patients = Patient.where(:doctor_id => params[:doctor_id]).order("created_at DESC")
		else
			@patients = Patient.all.order("created_at DESC")

SELECT "conditions".* FROM "conditions"
---
	def new
		@patient = current_doctor.patients.build
		@conditions = Condition.all.map{ |c| [c.name,c.id]}

INSERT INTO "patients" ("fname", "lname", "address", "dob", "bloodtype", "alergies", "created_at", "updated_at", "doctor_id", "condition_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@patient = current_doctor.patients.build(patient_params)
		@patient.condition_id = params[:condition_id]

		if @patient.save

SELECT "conditions".* FROM "conditions"
---
	def edit
		@conditions = Condition.all.map{ |c| [c.name,c.id]}

UPDATE "patients" SET "condition_id" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["condition_id", 3], ["updated_at", 2017-02-27 17:39:31 UTC], ["id", 9]]
---
	def update
		@patient.condition_id = params[:condition_id]
		if @patient.update(patient_params)

DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]
---
	def destroy
		@patient.destroy

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
		def find_patient
			@patient = Patient.find(params[:id])