app/controllers/patients_controller.rb

	def index
		if params[:condition].blank?
---
SELECT "conditions".* FROM "conditions"