app/controllers/reports_controller.rb

	def create
		@report = Report.new(report_params)
		@report.doctor_id = current_doctor.id
		@report.patient_id = @patient.id

		if @report.save
---
INSERT INTO "reports" ("date", "report", "created_at", "updated_at", "doctor_id", "patient_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", "dfd"], ["report", "dfdf"], ["created_at", 2017-03-13 10:53:36 UTC], ["updated_at", 2017-03-13 10:53:36 UTC], ["doctor_id", 3], ["patient_id", 13]]

	def update
		if @report.update(report_params)
---
UPDATE "reports" SET "date" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["date", "11/07/2015"], ["updated_at", 2017-04-11 13:12:48 UTC], ["id", 7]]

	def destroy
		@report.destroy
---
DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 2]]

		def find_patient
			@patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

		def find_report
			@report = Report.find(params[:id])
---
SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]